[
  {
    "title": "Moodboard",
    "image": "../projectImages/fontologo.png",
    "technologies": "Connected to Sub-Research Question 4",
    "description":"Creating a moodboard for a portfolio website is essential as it helps establish a cohesive visual direction and aesthetic for your online presence. It allows you to gather and arrange design elements, color schemes, typography, and imagery that align with your personal brand and desired message. A moodboard serves as a visual guide throughout the design process, ensuring consistency and conveying the desired atmosphere to captivate potential clients or employers.",
    "description2": "To create a moodboard for a portfolio website, start by collecting visual inspiration images, screenshots, color palettes, typography, and textures that align with the desired look and feel of your final website. Arrange these elements on a digital canvas, focusing on creating a cohesive visual narrative that reflects the website's desired mood, style, and user experience. Use the moodboard as a reference throughout the design process to ensure consistency and convey the intended aesthetic.",
    "bgcolor": "purple",
    "id": "1"
 
  },

  {
    "title": "Benchmark Creation",
    "image": "../projectImages/fontologo.png",
    "description": "The Benchmark Creation method provided  a way to evaluate the effectiveness of different design alternatives or solutions. By conducting a benchmark creation assessment, designers can establish a baseline which they can compare the performance of their designs to others in the industry, allowing for them to confirm that they are meeting industry standards.  This allows for designers to see strengths and weaknesses and make improvements in their own design, ensuring that they have selected the best design option.",
    "description2": "To conduct benchmark creation for a portfolio website, begin by researching and exploring a variety of existing portfolio websites in your industry. Analyze their layouts, navigation, content organization, visual aesthetics, and overall user experience. Identify successful elements and patterns that align with your goals and target audience. Use these benchmarks as a reference to guide the design and development of your portfolio website, incorporating the best practices while adding your unique touch to stand out in the competitive landscape.",
    "technologies": "Connected to Sub-Research Question 1 & 3 ",
    "bgcolor": "blue",
    "id": "2"
  },
  {
    "title": "Usability Testing",
    "image": "../projectImages/fontologo.png",
    "description": "Usability testing for a portfolio website is crucial to ensure that it effectively communicates your skills and work to potential clients or employers. It helps identify user experience issues, usability barriers, and areas of improvement that may hinder visitors from navigating or engaging with your portfolio. By conducting usability testing, you can gather valuable feedback, make informed design decisions, and optimize your website's usability to create a seamless and impactful user experience.",
    "description2": "To conduct usability testing for a portfolio website, start by defining specific tasks or scenarios that users would typically engage with on the site. Recruit a diverse group of participants who represent your target audience. Observe and record their interactions with the website, noting any issues, confusion, or areas of improvement. Collect feedback through post-test interviews or surveys to gain insights into the user experience and make data-driven improvements to enhance the usability and effectiveness of your portfolio website.",
    "technologies": "Connected to Sub-Research Question 2 ",
    "bgcolor": "blue",
    "id": "3"
  },
  {
    "title": "Wireframes",
    "image": "../projectImages/fontologo.png",
    "description": "Creating wireframes for a portfolio website is essential to plan and structure the layout and content before diving into visual design. Wireframes provide a simplified representation of the website's elements, such as navigation, sections, and content placement, allowing you to focus on the site's structure and user flow. They serve as a blueprint for your portfolio, helping you visualize and iterate on the layout and ensure a well-organized and intuitive user experience.",
    "description2": "To create wireframes for a portfolio website, begin by outlining the key sections and content you want to include. Use a wireframing tool or pen and paper to sketch the basic layout, focusing on the placement of elements, such as navigation, headings, images, and text. Keep the wireframes simple and devoid of detailed visuals to prioritize the structure and hierarchy of information. Iterate and refine the wireframes based on feedback and user testing to ensure optimal usability and a clear representation of your portfolio's content.",
    "technologies": "Connected to Sub-Research Question 1 & 2 ",
    "bgcolor": "purple",
    "id": "4"
  }
]
